Rechnerubung/Week6/turbulent_channel_periodic_with_paraview/turbulent_channel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0   0  -0.5)   //0
    (1   0  -0.5)   //1

    (0  0.1 -0.5)   //2
    (1  0.1 -0.5)   //3
//
    (0   0   0.5)   //4
    (1   0   0.5)   //5

    (0  0.1  0.5)   //6
    (1  0.1  0.5)   //7
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (2 90 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type             cyclic;
        neighbourPatch   outlet;
        faces
        (
            (0 4 6 2)
        );
    }
    outlet
    {
        type             cyclic;
        neighbourPatch   inlet;
        faces
        (
            (1 3 7 5)
        );
    } 
    bottom
    {
        type symmetry;
        faces
        (
            (2 6 7 3)
        );
    }
    top
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    frontAndBack //openFoam omits using this face as its type is empty
    {
        type empty;
        faces
        (
        (0 2 3 1)
	    (4 5 7 6)
        );
    }
);

// mergePatchPairs
// (
// );

// ************************************************************************* //
