Rechnerubung/Week6/turbulent_channel_periodic_with_paraview/turbulent_channel/system/stressComponents
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;

fields          (devReff);
